{
  "phrases": [
    "Ромгол и Данпуз идут по Красной площади. Ромгол говорит: — Я могу стоять здесь и кричать, что наш генеральный секретарь — дурак! Данпуз отвечает: — Я тоже могу. Но если мы оба это сделаем, нас обоих арестуют за разглашение государственной тайны.",
    "Ромгол заходит в магазин и спрашивает: — У вас есть колбаса? Продавец отвечает: — Нет. Ромгол вздыхает и уходит. Через минуту заходит Данпуз: — А что у вас есть? Продавец: — У нас есть то же самое, что и у Ромгола — ничего.",
    "Ромгол приходит в райком партии: — Хочу вступить в партию. Ему дают анкету. Вопрос: «Ваше отношение к анкетам?» Ромгол пишет: «Нейтральное». В этот момент заходит Данпуз: — Ромгол, ты что, с ума сошел? Здесь же все вопросы с подвохом!",
    "Ромгол приходит к врачу: — Доктор, у меня голова болит. Врач: — Вы пьете? Ромгол: — Нет. Врач удивляется. Заходит Данпуз: — У меня тоже голова болит. Врач: — Вы пьете? Данпуз: — Да. Врач кивает: — Ну вот, а Ромгол не пьет, и у него тоже болит. Значит, причина не в этом.",
    "Ромгол и Данпуз стоят в очереди за хлебом. Ромгол: — Скоро коммунизм наступит, и очередей не будет. Данпуз: — Да, но тогда и хлеба не будет.",
    "Ромгол говорит Данпузу: — Я вчера выиграл в лотерею автомобиль! Данпуз: — Поздравляю! А где он? Ромгол: — Да пока только номер выиграл.",
    "Данпуз спрашивает Ромгола: — Почему ты не аплодируешь? Ромгол: — Я забыл дома руки.",
    "Ромгол приходит в библиотеку: — Дайте мне Карла Маркса. Библиотекарь: — На дом не выдается. Ромгол: — А куда же его выдают? Данпуз шепчет: — На работе.",
    "Данпуз говорит Ромголу: — Ты слышал? По радио сказали, что в Америке безработица! Ромгол: — А у нас нет безработицы. Данпуз: — Зато есть те, кто не работает!",
    "Ромгол и Данпуз идут по улице. Ромгол: — Смотри, новый лозунг: «Экономика должна быть экономной!» Данпуз: — Могли бы хоть на буквах сэкономить.",
    "Данпуз спрашивает Ромгола: — Правда ли, что в СССР можно свободно критиковать правительство? Ромгол: — Конечно! В Америке можно критиковать советское правительство, и у нас тоже можно критиковать советское... то есть американское правительство!",
    "Ромгол получил квартиру и говорит Данпузу: — Наконец-то дали жилплощадь! Данпуз: — Поздравляю! Большая? Ромгол: — Ну, когда мы с женой в разных углах стоим, получается двухкомнатная.",
    "Данпуз спрашивает Ромгола: — Почему у нас мяса нет? Ромгол: — Потому что мы миролюбивая страна. Данпуз: — А при чем тут мясо? Ромгол: — А мы танки не едим!",
    "Ромгол звонит в дверь к Данпузу ночью. Данпуз: — Кто там? Ромгол: — Это я, открывай! Данпуз: — А зачем посреди ночи? Ромгол: — Да тут в очередь за колбасой занимать надо, она с утра будет!",
    "Данпуз говорит Ромголу: — Слышал анекдот про Брежнева? Ромгол оглядывается: — Нет, не слышал. Данпуз тоже оглядывается: — И я не слышал. И ты не слышал. Запомни!",
    "Ромгол приходит на работу с синяком. Данпуз: — Что случилось? Ромгол: — Да вчера рассказал анекдот про партию. Данпуз: — И тебя избили? Ромгол: — Нет, просто я забыл, что рассказывал его на партсобрании.",
    "Данпуз спрашивает Ромгола: — Скажи, что такое капитализм? Ромгол: — Это эксплуатация человека человеком. Данпуз: — А социализм? Ромгол: — А социализм — это наоборот.",
    "Ромгол и Данпуз смотрят советское кино. Ромгол: — Смотри, какая любовь! Данпуз: — Да, любовь к партии такая сильная, что на личную жизнь времени не остается.",
    "Данпуз жалуется Ромголу: — Меня на работе критикуют. Ромгол: — За что? Данпуз: — Говорят, что я неправильно понимаю решения партии. Ромгол: — А ты как понимаешь? Данпуз: — Да никак не понимаю!",
    "Ромгол говорит Данпузу: — Я придумал, как за два года построить коммунизм! Данпуз: — Как? Ромгол: — Один год будем строить, второй — отчитываться, что построили!",
    "Данпуз приходит к Ромголу: — Ты слышал про дефицит? Ромгол: — Какой еще дефицит? Данпуз: — Ну, того... всего. Ромгол: — А, ты про изобилие товаров на складах говоришь?",
    "Ромгол спрашивает у Данпуза: — Почему у нас в магазинах пусто? Данпуз: — Потому что мы помогаем братским народам! Ромгол: — А почему у них полно? Данпуз: — Потому что им никто не помогает.",
    "Данпуз говорит Ромголу: — Вчера в газете прочитал, что у нас самый высокий уровень жизни в мире! Ромгол: — Интересно, а в какой стране они это читали?",
    "Ромгол приходит домой и говорит Данпузу: — Представляешь, сегодня в автобусе меня назвали шпионом! Данпуз: — За что? Ромгол: — Да я просто сказал, что видел масло в магазине!",
    "Данпуз спрашивает Ромгола: — Правда, что при коммунизме все будет бесплатно? Ромгол: — Правда! Данпуз: — А откуда все возьмется? Ромгол: — Так это уже детали.",
    "Ромгол и Данпуз на приеме у психиатра. Врач: — На что жалуетесь? Ромгол: — Доктор, я думаю, что я занавеска. Данпуз: — А я думаю, что я половая тряпка. Врач: — Странно, обычно у нас думают, что они Наполеон.",
    "Данпуз говорит Ромголу: — Слышал, Америка нам кукурузу продает? Ромгол: — Да, за валюту. Данпуз: — А что мы им даем? Ромгол: — Анекдоты про кукурузу!",
    "Ромгол спрашивает Данпуза: — Скажи, а что будет после коммунизма? Данпуз задумывается: — Наверное, полный коммунизм. Ромгол: — А потом? Данпуз: — Потом извинения.",
    "Данпуз встречает Ромгола: — Ты куда? Ромгол: — На митинг. Данпуз: — Добровольно? Ромгол: — Конечно! Меня всего три раза предупредили.",
    "Ромгол говорит Данпузу: — Знаешь, я понял разницу между нами и Западом. Данпуз: — Какую? Ромгол: — У них кризис перепроизводства, а у нас — кризис недопроизводства. Но оба кризиса!",
    "Данпуз рассказывает Ромголу: — Вчера видел в магазине импортные джинсы! Ромгол: — Купил? Данпуз: — Нет, просто смотрел два часа. Развлекаюсь как могу.",
    "Ромгол приходит к Данпузу: — Послушай анекдот. Встречаются два человека... Данпуз перебивает: — Стой! А они случайно не из партии? Ромгол: — Нет. Данпуз: — Тогда можно.",
    "Данпуз спрашивает Ромгола: — Что такое советская диалектика? Ромгол: — Это когда ты встаешь в очередь утром за колбасой, а получаешь вечером рыбу, и радуешься, что хоть что-то дали.",
    "Ромгол говорит Данпузу: — Я вчера купил дефицит! Данпуз: — Что именно? Ромгол: — Не знаю, просто увидел очередь и встал.",
    "Данпуз жалуется Ромголу: — Меня вызвали в КГБ. Ромгол: — За что? Данпуз: — Не знаю, я только подумал что-то не то. Ромгол: — Так ты же не говорил! Данпуз: — А они откуда узнали?!",
    "Ромгол и Данпуз слушают радио. Диктор: — У нас все хорошо, а на Западе все плохо! Ромгол: — Данпуз, а почему тогда все хотят на Запад? Данпуз: — Видимо, любят трудности.",
    "Данпуз спрашивает Ромгола: — А правда, что Рабинович выиграл «Волгу»? Ромгол: — В принципе да, только не Рабинович, а Иванов, и не «Волгу», а сто рублей, и не выиграл, а у него украли.",
    "Ромгол говорит Данпузу: — Вчера прочитал, что в Америке негров притесняют. Данпуз: — Ужас какой! Ромгол: — Да уж, хорошо, что у нас негров нет.",
    "Данпуз приходит к Ромголу: — Слушай, а что такое финансовая пропасть? Ромгол: — Это когда зарплату получаешь сегодня, а до конца месяца еще три недели.",
    "Ромгол спрашивает Данпуза: — Что общего между советским автомобилем и газетой «Правда»? Данпуз: — Не знаю. Ромгол: — Оба выходят раз в пять лет, и оба никто не читает.",
    "Данпуз говорит Ромголу: — Представляешь, мне дали путевку в санаторий! Ромгол: — Поздравляю! А куда? Данпуз: — На завод, второй раз за год.",
    "Ромгол встречает Данпуза: — Ты почему такой грустный? Данпуз: — Да вот, хотел купить импортный магнитофон. Ромгол: — И что? Данпуз: — Продали. Кому-то другому.",
    "Данпуз спрашивает Ромгола: — Скажи, а если я скажу то, что думаю, что со мной будет? Ромгол: — Ничего не будет. Данпуз: — Точно? Ромгол: — Ну, если только десять лет ничего не будет.",
    "Ромгол и Данпуз идут мимо памятника Ленину. Данпуз: — Смотри, какой величественный! Ромгол: — Да, правая рука указывает в светлое будущее. Данпуз: — А левая в кармане. Наверное, проверяет, на месте ли зарплата.",
    "Данпуз говорит Ромголу: — Читал, что на Западе безработица миллион человек! Ромгол: — Ужас! Данпуз: — А у нас вообще нет безработных! Ромгол: — Да, у нас просто миллион лишних рабочих мест.",
    "Ромгол приходит на рынок и говорит Данпузу: — Смотри, помидоры! Данпуз: — Почем? Продавец: — Рубль килограмм. Ромгол: — Дорого. Продавец: — Так они заграничные! Данпуз: — А почему мятые? Продавец: — Так через границу бросали!",
    "Данпуз спрашивает Ромгола: — Что такое развитой социализм? Ромгол: — Это когда социализм развился так, что дальше некуда.",
    "Ромгол говорит Данпузу: — Слышал, планируют пятилетку за три года! Данпуз: — Здорово! Ромгол: — Да, только работать придется все пять лет.",
    "Данпуз встречает Ромгола с чемоданом: — Куда собрался? Ромгол: — В Америку эмигрировать! Данпуз: — Совсем? Ромгол: — Нет, только за колбасой.",
    "Ромгол спрашивает Данпуза: — А правда, что можно жить при коммунизме и не быть счастливым? Данпуз: — Можно, только недолго."
  ]
}
