{
  "phrases": [
    "Каковы основные различия между процессами и потоками в контексте управления ресурсами и производительности?",
    "Что такое TLB (Translation Lookaside Buffer) и как он влияет на производительность системы?",
    "Как работает механизм виртуальной памяти в современных операционных системах?",
    "Что представляет собой decltype(auto) в C++ и в каких случаях его следует использовать?",
    "Каковы преимущества и недостатки микроядерной архитектуры операционных систем?",
    "Что такое атомарные операции и как они реализуются в C++?",
    "Как работает механизм copy-on-write при создании процессов?",
    "Что такое false sharing в многопоточном программировании и как его избежать?",
    "Каковы основные принципы работы планировщика задач в операционной системе?",
    "Что такое RAII (Resource Acquisition Is Initialization) и как этот идиом применяется в C++?",
    "Как работает механизм страничного кэширования в процессорах?",
    "Что такое memory barrier и зачем он нужен в многопоточном программировании?",
    "Каковы основные различия между mutex и spinlock?",
    "Что такое deadlock и какие существуют методы его предотвращения?",
    "Как работает механизм lazy loading в операционных системах?",
    "Что такое perfect forwarding в C++ и как оно реализуется?",
    "Каковы основные принципы работы системы прерываний в архитектуре компьютера?",
    "Что такое thread pool и какие преимущества он предоставляет?",
    "Как работает механизм copy elision в C++?",
    "Что такое NUMA (Non-Uniform Memory Access) и как она влияет на производительность многопоточных приложений?",
    "Каковы основные различия между heap и stack памятью?",
    "Что такое memory-mapped files и как они используются в операционных системах?",
    "Как работает механизм exception safety в C++?",
    "Что такое lock-free программирование и какие преимущества оно предоставляет?",
    "Каковы основные принципы работы кэш-памяти в современных процессорах?",
    "Что такое std::future и std::promise в C++ и как они используются?",
    "Как работает механизм demand paging в операционных системах?",
    "Что такое SFINAE (Substitution Failure Is Not An Error) и как оно применяется в C++?",
    "Каковы основные различия между preemptive и cooperative многозадачностью?",
    "Что такое std::atomic и как он обеспечивает безопасность в многопоточном программировании?",
    "Как работает механизм context switch в операционных системах?",
    "Что такое CRTP (Curiously Recurring Template Pattern) и как оно используется в C++?",
    "Каковы основные принципы работы файловой системы journaling?",
    "Что такое std::condition_variable и как оно используется для синхронизации потоков?",
    "Как работает механизм branch prediction в современных процессорах?",
    "Что такое variadic templates в C++ и как они реализуются?",
    "Каковы основные различия между hard и soft ссылками в файловых системах?",
    "Что такое std::shared_ptr и как он управляет ресурсами?",
    "Как работает механизм speculative execution в процессорах?",
    "Что такое std::unique_ptr и в чем его отличие от std::shared_ptr?",
    "Каковы основные принципы работы системы виртуализации в операционных системах?",
    "Что такое std::move и как оно используется для семантики перемещения в C++?",
    "Как работает механизм out-of-order execution в современных процессорах?",
    "Что такое std::optional и в каких случаях его следует использовать?",
    "Каковы основные различия между monolithic и microkernel архитектурами операционных систем?",
    "Что такое std::variant и как оно используется для хранения различных типов данных?",
    "Как работает механизм instruction pipelining в процессорах?",
    "Что такое std::any и в каких случаях его следует использовать?",
    "Каковы основные принципы работы системы управления памятью в операционных системах?",
    "Что такое std::filesystem и какие возможности оно предоставляет для работы с файловой системой?"
  ]
}
